ams/src/Catalogs/_ВариантыСпецификацийНоменклатуры/_ВариантыСпецификацийНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>_ВариантыСпецификацийНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыСпецификаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопускНаЗамес</name>
    <comment>Допустимое отклонение от нормы в одном замесе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопускНаУпаковку</name>
    <comment>Допустимое отклонение от нормы в одном замесе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереработкаБрака</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Enums/_СтатусыСпецификаций/_СтатусыСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_СтатусыСпецификаций</name>
  <enumValues>
    <name>НеСогласована</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

ams/src/Catalogs/_ВариантыСпецификацийНоменклатуры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения = Неопределено Или ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Владелец", Владелец) И ЗначениеЗаполнено(Владелец) Тогда
		Основной = Не ЗначениеЗаполнено(AMS_ВызовСервера.ПолучитьОсновнуюСпецификацию(Владелец));
	КонецЕсли;
	
	Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "Наименование, _Упаковка, КоэффициентЕдиницыДляОтчетов");
	
	Наименование = Стр.Наименование;
	Статус       = ПредопределенноеЗначение("Перечисление._СтатусыСпецификаций.НеСогласована");
	
	Если AMS_ВызовСервера.ЭтоПродукцияAMS(Владелец) Тогда
		Упаковка           = Стр._Упаковка;
		КоличествоУпаковок = 1;
		Количество         = КоличествоУпаковок * Стр.КоэффициентЕдиницыДляОтчетов;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Основной = Не ЗначениеЗаполнено(AMS_ВызовСервера.ПолучитьОсновнуюСпецификацию(Владелец));
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Или Не Основной  Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ЗапросТекст = "ВЫБРАТЬ
		|	т.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник._ВариантыСпецификацийНоменклатуры КАК т
		|ГДЕ
		|	т.Владелец = &Владелец
		|	И т.Основной
		|	И т.Ссылка <> &Ссылка"; 
		
	Иначе
		ЗапросТекст = "ВЫБРАТЬ
		|	т.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник._ВариантыСпецификацийНоменклатуры КАК т
		|ГДЕ
		|	т.Владелец = &Владелец
		|	И т.Основной";
	КонецЕсли;

	Запрос.Текст = ЗапросТекст;
	
	Выб = Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		Объект = Выб.Ссылка.ПолучитьОбъект();
		Объект.Основной = Ложь;
		Объект.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
